In [1]:
from selenium import webdriver
from selenium.webdriver.chrome.service import Service
from webdriver_manager.chrome import ChromeDriverManager
from selenium.webdriver.common.by import By

servico = Service(ChromeDriverManager().install())
navegador = webdriver.Chrome(service = servico)

[WDM] - Downloading: 100%|████████████████████████████████████████████████████████| 6.58M/6.58M [00:00<00:00, 38.3MB/s]

In [2]:
navegador.get('https://g1.globo.com/economia/noticia/2022/01/06/veja-os-carros-mais-vendidos-de-2021-por-categoria.ghtml')

In [ ]:
# /html/body/div[2]/main/div[7]/article/div[3]/div[8]/ol/li[1]    #XPATH Primeiro carro  
# /html/body/div[2]/main/div[7]/article/div[3]/div[8]/ol/li[20]   #XPATH Último carro

In [3]:
lista_carros = []

for i in range(1,21):
    elemento = navegador.find_element(By.,'/html/body/div[2]/main/div[7]/article/div[3]/div[8]/ol/li['+ str(i) +']').text
    lista_carros.append(elemento)
print(lista_carros)

['Hyundai HB20: 86.455', 'Fiat Argo: 84.644', 'Jeep Renegade: 73.913', 'Chevrolet Onix: 73.623', 'Jeep Compass: 70.906', 'Volkswagen Gol: 66.228', 'Fiat Mobi: 65.847', 'Hyundai Creta: 64.759', 'Volkswagen T-Cross: 62.307', 'Chevrolet Onix Plus: 54.707', 'Renault Kwid: 52.916', 'Chevrolet Tracker: 50.757', 'Toyota Corolla: 41.891', 'Honda HR-V: 38.406', 'Volkswagen Nivus: 36.664', 'Nissan Kicks: 36.524', 'Toyota Corolla Cross: 34.249', 'Volkswagen Voyage: 28.593', 'Fiat Cronos: 27.887', 'Hyundai HB20S: 25.568']

In [5]:
dicionario_carros = {}

for i in range(20):
    split = lista_carros[i].split(':')
    chave_dic = split[0]
    valor_dic = split[1]
    dicionario_carros[chave_dic] = valor_dic
    
print(dicionario_carros)

{'Hyundai HB20': ' 86.455', 'Fiat Argo': ' 84.644', 'Jeep Renegade': ' 73.913', 'Chevrolet Onix': ' 73.623', 'Jeep Compass': ' 70.906', 'Volkswagen Gol': ' 66.228', 'Fiat Mobi': ' 65.847', 'Hyundai Creta': ' 64.759', 'Volkswagen T-Cross': ' 62.307', 'Chevrolet Onix Plus': ' 54.707', 'Renault Kwid': ' 52.916', 'Chevrolet Tracker': ' 50.757', 'Toyota Corolla': ' 41.891', 'Honda HR-V': ' 38.406', 'Volkswagen Nivus': ' 36.664', 'Nissan Kicks': ' 36.524', 'Toyota Corolla Cross': ' 34.249', 'Volkswagen Voyage': ' 28.593', 'Fiat Cronos': ' 27.887', 'Hyundai HB20S': ' 25.568'}

In [6]:
import pandas as pd

In [8]:
df = pd.DataFrame(list(dicionario_carros.items()))
df.head()

                0        1
0    Hyundai HB20   86.455
1       Fiat Argo   84.644
2   Jeep Renegade   73.913
3  Chevrolet Onix   73.623
4    Jeep Compass   70.906

In [9]:
df = df.rename(columns = {0:'Carro',1:'Emplacamento'})
df

                   Carro Emplacamento
0           Hyundai HB20       86.455
1              Fiat Argo       84.644
2          Jeep Renegade       73.913
3         Chevrolet Onix       73.623
4           Jeep Compass       70.906
5         Volkswagen Gol       66.228
6              Fiat Mobi       65.847
7          Hyundai Creta       64.759
8     Volkswagen T-Cross       62.307
9    Chevrolet Onix Plus       54.707
10          Renault Kwid       52.916
11     Chevrolet Tracker       50.757
12        Toyota Corolla       41.891
13            Honda HR-V       38.406
14      Volkswagen Nivus       36.664
15          Nissan Kicks       36.524
16  Toyota Corolla Cross       34.249
17     Volkswagen Voyage       28.593
18           Fiat Cronos       27.887
19         Hyundai HB20S       25.568